reports/artillery_log.txt
Phase started: unnamed (index: 0, duration: 1s) 10:42:44(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 10:42:45(-0300)

--------------------------------------
Metrics for period to: 10:42:50(-0300) (width: 5.699s)
--------------------------------------

http.codes.200: ................................................................ 229
http.request_rate: ............................................................. 43/sec
http.requests: ................................................................. 241
http.response_time:
  min: ......................................................................... 24
  max: ......................................................................... 954
  median: ...................................................................... 257.3
  p95: ......................................................................... 399.5
  p99: ......................................................................... 889.1
http.responses: ................................................................ 229
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20


--------------------------------------
Metrics for period to: 10:43:00(-0300) (width: 9.982s)
--------------------------------------

http.codes.200: ................................................................ 472
http.request_rate: ............................................................. 48/sec
http.requests: ................................................................. 475
http.response_time:
  min: ......................................................................... 83
  max: ......................................................................... 433
  median: ...................................................................... 278.7
  p95: ......................................................................... 361.5
  p99: ......................................................................... 383.8
http.responses: ................................................................ 472


--------------------------------------
Metrics for period to: 10:43:10(-0300) (width: 7.277s)
--------------------------------------

http.codes.200: ................................................................ 299
http.request_rate: ............................................................. 41/sec
http.requests: ................................................................. 284
http.response_time:
  min: ......................................................................... 81
  max: ......................................................................... 758
  median: ...................................................................... 278.7
  p95: ......................................................................... 441.5
  p99: ......................................................................... 561.2
http.responses: ................................................................ 299
vusers.completed: .............................................................. 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 20993.6
  max: ......................................................................... 22645.3
  median: ...................................................................... 21813.5
  p95: ......................................................................... 22254.1
  p99: ......................................................................... 22254.1


All VUs finished. Total time: 25 seconds

--------------------------------
Summary report @ 10:43:09(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 44/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 24
  max: ......................................................................... 954
  median: ...................................................................... 267.8
  p95: ......................................................................... 383.8
  p99: ......................................................................... 757.6
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 20993.6
  max: ......................................................................... 22645.3
  median: ...................................................................... 21813.5
  p95: ......................................................................... 22254.1
  p99: ......................................................................... 22254.1